{
  "id": "24",
  "date": "01 31 2014",
  "year": "2014",
  "blog_item_category": "News",
  "related_blog_items": [13],
  "prev_item": "23",
  "next_item": "0",
  "featured": "false",
  "title": "September Newsletter: Special Olympics Athletes Receive the Gift of Hearing",
  "text": "<p>After the team returned from fitting more than 10,000 people in&nbsp;Peru&nbsp;and&nbsp;Mexico, our campus was flooded with inspiration when 22 Special Olympics Minnesota athletes and their families arrived for a homegrown mission. The Foundation has partnered with Special Olympics Minnesota on its Healthy Hearing Athletes Initiative, and this mission kicked off what we hope will become a long and life-changing collaboration that will open up the world of sound to all Special Olympics athletes in need. Each athlete was fit with top-of-the-line, customized hearing aids that opened up the world of sound like never before.</p>  <p>Discussing the significance of this mission, Bill Austin said, &ldquo;We don&rsquo;t believe in disabilities. We believe in ability. Everybody has it, and we have to find it and use it and maximize it.&rdquo;</p>  <p>Former Minnesota Viking Matt Blair was also on hand to support the athletes, including his good friend Katie Timmer. She has been participating in Special Olympics for more than 30 years and met Blair at a golf tournament. Over the years, Blair has become Timmer&rsquo;s biggest fan. Unfortunately, She suffered from a hearing loss that had begun to affect her performance, but once she received the gift of hearing, she couldn&rsquo;t wait to get back out on the golf course.</p>  <p>Special Olympics president, Dave Dorn, said the partnership with the Foundation would make a huge difference in each of the athlete&rsquo;s lives.</p>  <p>&ldquo;It&rsquo;s a&nbsp;confidence&nbsp;builder,&rdquo; Dorn said. &ldquo;They can be engaged in conversations and hear the world around them. All of a sudden they are much more participatory and active in their surroundings because they can hear what&rsquo;s going on.&rdquo;</p>  <p>The mission team is currently on its way to South Africa which will be followed by missions in Lesotho and Kenya.</p>  <h3>The Power of Partnerships</h3>  <p>President Bill Clinton and Chelsea Clinton once again joined the team on a recent mission swing through in Zambia, Tanzania and Rwanda to see our 1 million hearing aid commitment in action. Our latest film showcases the power of partnerships in providing the gift of hearing and tackling some of the world&rsquo;s most challenging issues.</p>  <p>Watch as powerful organizations come together to create lasting change.&nbsp;</p>  <p style=\"margin-left: 480px;\"><img alt=\"\" src=\"http://starkey.ahundredyears.com/uploads/special_olympics_mission.jpg\" style=\"height:200px; width:300px\" /></p>  <h3>Join us for a Hearing Protection Twitter Chat!</h3>  <p>October is National Protect Your Hearing Month! Research shows that 1 in 5 teens in the United States has hearing loss, largely due to high-volume sounds in daily life, such as music streamed loudly into headphones. Most hearing loss among teens can be avoided if simple protective measures &ndash; such as lowering the volume &ndash; are taken.</p>  <h3>Your hearing is fragile. So don&rsquo;t listen loudly. Listen Carefully.</h3>  <p>Join us on Twitter Thursday, October 3, from 12-1 p.m. CDT as Starkey Hearing Foundation and Starkey Hearing Technologies discuss ways to protect your hearing and prevent hearing loss!</p>  <p>If you&rsquo;re new to Twitter chats,&nbsp;here&rsquo;s an overview of how it works&hellip;</p>  <p>Commit Today</p>  <p>Pledge your support today&nbsp;and help us change a life during our upcoming missions in South Africa or <a href=\"http://lesotho.com\">Lesotho</a>.</p>",
  "thumbnail_image_url": "http://starkey.ahundredyears.com/uploads/September_Newsletter.jpg",
  "image_url": "http://starkey.ahundredyears.com/uploads/September_Newsletter.jpg",
  "author":"SHF Team"
}

