{
  "id": "15",
  "date": "01 20 2014",
  "blog_item_category": "Hearing Missions",
  "related_blog_items": [],
  "featured": "true",
  "title": "October Newsletter: A Knight and a Prince Help Kick Off Fall Missions",
  "text": "<p><strong>A Knight and a Prince Help Kick Off Fall Missions</strong></p>  <p>&nbsp; Striving for a strong finish to a record-breaking year, the mission team began its fall by spending October giving the gift of hearing in <a href=\"http://www.starkeyhearingfoundation.org/missions/africa/south-africa-10-2013/\" title=\"\">South Africa</a>, <a href=\"http://www.starkeyhearingfoundation.org/missions/africa/lesotho-10-2013/\" title=\"\">Lesotho</a> and Kenya.</p>  <p>&nbsp; The team started out in South Africa where partnered with Sir Richard Branson and <a href=\"http://www.virgin.com/unite\" title=\"\">Virgin Unite</a> for the third time to bring the gift of hearing to hundreds of people in need at Virgin Unite&rsquo;s Bhubezi Healthcare Clinic.</p>  <p>&nbsp; Next, we headed to Lesotho. It was our first hearing mission in the country where we had another wonderful partner in <a href=\"http://sentebale.org/\" title=\"\">Sentebale</a>, a nonprofit organization co-founded by Prince Harry and Prince Seeiso of Lesotho, who participated in the fittings. Patients, ranging from 4 to 101 years old, traveled from all parts of the small, landlocked country to have their hearing assessed and be fitted for hearing aids. For many it was an opportunity to hear for the very first time.</p>  <p>&nbsp; After being honored at the 13th Annual Starkey Hearing Foundation&rsquo;s <em>So the World May Hear Awards</em>Gala in July, Branson joined us to bring the gift of hearing to Virgin Unite&rsquo;s Bhubezi Healthcare Clinic. More than 300 patients from the surrounding Bushbruckridge community were fit with hearing aids. Branson and the Virgin Unite team worked closely with us to ensure each patient left the mission with a new connection to sound and life.</p>  <p>&nbsp; Discussing his continued dedication to the work of the Foundation, Branson said, &ldquo;I admire the Starkey Hearing Foundation for its tireless effort to transform lives with the gift of hearing. I hope it will inspire others, businesses and nonprofits alike, to seek new, innovative and entrepreneurial ways of making a difference in people&rsquo;s lives.&rdquo;</p>  <p>&nbsp; Once the team wrapped up a successful mission in South Africa, we headed to our first mission in Lesotho with new partner <a href=\"http://sentebale.com\">Sentebale</a>.</p>  <p>&nbsp; Prince Seeiso joined the team to help fit hearing aids and open up the world of sound to many living in silence and isolation. &ldquo;I have seen children wanting to talk to each other, and their eyes tell a thousand stories,&rdquo; Prince Seeiso said. &ldquo;On behalf of myself, Prince Harry and Sentebale, a big thanks goes to Starkey Hearing Foundation.&rdquo;</p>  <p>&nbsp; The team is currently in Kenya, where we have traveled from Mombasa to Eldoret to one of the largest slums in Africa, Kibera, to Meru, all the while reflecting caring and connecting communities with the gift of hearing.</p>  <p>&nbsp; <strong>2013 Gala Highlights</strong></p>  <p>&nbsp; Whether it was the bald eagle soaring over the crowd as Nita Whitaker sang &ldquo;AmazingGrace,&rdquo; impassioned speeches from twin brothers Ashton and Michael Kutcher, or special surprise guests for Bill Austin, the 2013 <em>So the World May Hear</em> Awards Gala was an evening we will never forget. Our latest film brings you all the highlights and magic from this year&rsquo;s Gala.</p>  <p>&nbsp; <a href=\"http://youtu.be/KD8h8zNpd48\" title=\"\">Watch as the world comes together to celebrate the power of caring.</a></p>  <p>&nbsp; <strong>Listen Carefully with Tony Hawk and the Minnesota Vikings</strong></p>  <p><span style=\"line-height:1.6em\">&nbsp; October is National Protect Your Hearing Month, and we&rsquo;ve been encouraging people toturn down the volume and Listen Carefully with Chris and Kyle Massey at skateboarding legend Tony Hawk&rsquo;s 2013 </span><a href=\"http://standupforskateparks.org/\" style=\"line-height: 1.6em;\" title=\"\">Stand Up for Skateparks</a><span style=\"line-height:1.6em\"> and with the help of the </span><a href=\"http://www.starkeyhearingfoundation.org/vikings/\" style=\"line-height: 1.6em;\" title=\"\">Minnesota Vikings</a><span style=\"line-height:1.6em\">.</span></p>  <p>&nbsp; Remember: Your hearing is fragile. So don&rsquo;t listen loudly. Listen Carefully.</p>  <p>&nbsp;</p>  <p>&nbsp; Chris and Kyle Massey joined our team as we spread the word about the importance of protecting your hearing at the 2013 Stand Up for Skateparks, and we were encouraged to see the message stick as much of the audience wore the hearing protection we distributed during a headlining performance by Modest Mouse.</p>  <p>&nbsp;</p>  <p>&nbsp; The Minnesota Vikings have teamed up with our Listen Carefully campaign to encourage fans to protect their hearing, and they are donating $500 to the Foundation for every touchdown scored this season by Adrian Peterson or Greg Jennings. Vikings fans should also be on the look out for Listen Carefully hearing protection at all home games.</p>",
  "thumbnail_image_url": "http://starkey.ahundredyears.com/uploads/Blog_A_Knight.jpg",
  "image_url": "http://starkey.ahundredyears.com/uploads/Blog_A_Knight.jpg"
}
